init.org
#+PROPERTY:    header-args        :results silent   :eval no-export   :comments org
#+PROPERTY:    header-args:elisp  :tangle ~/projects/emacs-config/init.el

* Setup
** Personal info and constants
 #+begin_src elisp
 (defconst as/emacs-directory (concat (getenv "HOME") "/.emacs.d/"))
 (defconst as/elisp (concat (getenv "HOME") "/projects/emacs-config/"))
 (add-to-list 'load-path as/elisp)
 (setq user-full-name "Andrew Sanchez"
       user-mail-address "inbox.asanchez@gmail.com")
 #+end_src
** Package management
 #+begin_src elisp
   (require 'package)
       (add-to-list 'load-path "packages")
       (setq package-archives
           '(("gnu" . "http://elpa.gnu.org/packages/")
           ("marmalade" . "http://marmalade-repo.org/packages/")
             ("melpa" . "http://melpa.milkbox.net/packages/")
             ("melpa-stable" . "http://stable.melpa.org/packages/")
             ("elpy" . "https://jorgenschaefer.github.io/packages/")
             ("org" . "http://orgmode.org/elpa/")))
     (package-initialize)
     (unless (package-installed-p 'use-package)
       (package-refresh-contents)
       (package-install 'use-package))
     (eval-when-compile
       (require 'use-package))
     (setq use-package-always-ensure t)
     (setq use-package-verbose t)
   (use-package diminish
     :config
     (diminish 'undo-tree-mode))
 #+end_src
** Tangle init.el
[[https://emacs.stackexchange.com/questions/20707/automatically-tangle-org-files-in-a-specific-directory#20733][Automatically tangle]] this file on save.

#+begin_src elisp
(defun as/tangle-dotfiles ()
  "If the current file is in 'as/elisp' blocks are tangled"
  (when (equal (file-name-directory (directory-file-name buffer-file-name))
               as/elisp)
    (org-babel-tangle)
    (message "%s tangled" buffer-file-name)))
(add-hook 'after-save-hook #'as/tangle-dotfiles)
#+end_src
** Helpful
#+begin_src elisp
  (use-package helpful
    :commands
    (helpful-callable
     helpful-function
     helpful-macro
     helpful-command
     helpful-key
     helpful-variable
     helpful-at-point)
    :init
    (global-set-key (kbd "C-h f") #'helpful-callable)
    (global-set-key (kbd "C-h v") #'helpful-variable)
    (global-set-key (kbd "C-h k") #'helpful-key)
    (global-set-key (kbd "C-h o") #'helpful-at-point))
#+end_src
* Custom set variables
#+begin_src elisp
  (setq custom-file (expand-file-name "custom.el" as/elisp))
  (when (file-exists-p custom-file)
    (load custom-file))
#+end_src
* General Binding Config
Also check out [[https://github.com/nonsequitur/smex][smex]] 
#+begin_src elisp
  (global-set-key (kbd "C-6") 'evil-switch-to-windows-last-buffer)
  (global-set-key (kbd "C-w") 'evil-window-next)
  (global-set-key (kbd "C-x f") 'helm-find-files)
  
    (use-package which-key
	:defer 10
	:config
	(which-key-mode))
#+end_src
* Toggles
#+begin_src elisp
(evil-leader/set-key "tf" 'flyspell-mode)
#+end_src
* Evil
#+begin_src elisp
  (use-package evil-leader
    :config
    (global-evil-leader-mode)
    (setq evil-leader/in-all-states t)
    (setq evil-leader/non-normal-prefix "C-")
    (evil-leader/set-leader "<SPC>"))

  (use-package evil
      :config
      (evil-mode 1))

  (use-package evil-nerd-commenter
    :config
    (evil-leader/set-key
      "ci" 'evilnc-comment-or-uncomment-lines
      "cl" 'evilnc-quick-comment-or-uncomment-to-the-line
      "ll" 'evilnc-quick-comment-or-uncomment-to-the-line
      "cc" 'evilnc-copy-and-comment-lines
      "cp" 'evilnc-comment-or-uncomment-paragraphs
      "cr" 'comment-or-uncomment-region
      "cv" 'evilnc-toggle-invert-comment-line-by-line
      "."  'evilnc-copy-and-comment-operator
      "\\" 'evilnc-comment-operator))

  (use-package evil-surround
      :config
      (global-evil-surround-mode 1))

  (use-package evil-lisp-state
      :init (setq evil-lisp-state-global t)
      :config (evil-lisp-state-leader "<SPC> k"))

  ;; (use-package bind-map) 

  (use-package evil-matchit
    :config
    (require 'evil-matchit)
    (global-evil-matchit-mode 1))
#+end_src

** Exclude list
#+begin_src elisp
  (add-to-list 'evil-emacs-state-modes 'dired-mode)
  (add-to-list 'evil-emacs-state-modes 'flycheck-error-list-mode)
  (add-to-list 'evil-emacs-state-modes 'realgud-short-key-mode)
  (evil-set-initial-state 'realgud-short-key-mode 'emacs)
  (evil-set-initial-state 'Info-mode 'emacs)

#+end_src
* Navigation
#+begin_src elisp
  (use-package avy
    :init
    (defhydra hydra-avy (:color blue)
      "avy-goto"
      ("c" avy-goto-char "char")
      ("C" avy-goto-char-2 "char-2")
      ("w" avy-goto-word-1 "word")
      ("s" avy-goto-subword-1 "subword")
      ("l" avy-goto-line "line")
      ("u" link-hint-open-link "open-URI")
      ("U" link-hint-copy-link "copy-URI"))
    (evil-leader/set-key "j" 'hydra-avy/body)
    :commands hydra-avy/body
    :config
    (use-package link-hint))
#+end_src
* Misc
#+begin_src elisp
  (use-package expand-region
    :commands (er/expand-region)
    :config
    (global-set-key (kbd "C-=") 'er/expand-region))

  (evil-leader/set-key
    "!" 'shell-command)
#+end_src
* Modeline
Display a more compact mode line

#+begin_src elisp
  (use-package smart-mode-line
      :init
      (setq sml/no-confirm-load-theme t)
      (sml/setup))
  (display-time-mode 1)
#+end_src
* Helm
  Also check out [[https://github.com/abo-abo/swiper][ivy and swiper]] and helm-swiper.
#+begin_src elisp
  (use-package helm
    :init
    (evil-leader/set-key
	"sg" 'helm-google-suggest
	"<SPC>" 'helm-M-x
	"sj" 'helm-semantic-or-imenu
	"ha" 'helm-apropos
	"ho" 'helm-info-org
	"hi" 'helm-info
	"ss" 'helm-occur)
    :commands
    (helm-google-suggest helm-M-x helm-semantic-or-imenu helm-apropos helm-occur)
    :bind (("M-y" . helm-show-kill-ring)
	   ("C-h a" . helm-apropos)
	   ("M-x" . helm-M-x)
	   ("C-x b" . helm-buffers-list))
    :config
    (require 'helm-config))

    (use-package helm-descbinds
      :bind (("C-h b" . helm-descbinds)))
#+end_src
* Hydra
#+begin_src elisp
(use-package hydra)
#+end_src
** Buffers
#+begin_src elisp
  (defhydra hydra-buffers (:color blue)
    "Buffers"
    ("d" kill-this-buffer "kill buffer")
    ("s" (lambda () (interactive) (pop-to-buffer "*scratch*")) "*scratch*")
    ("i" (lambda () (interactive) (pop-to-buffer "*info*")) "*info*")
    ("h" (lambda () (interactive) (pop-to-buffer "*Help*")) "*Help*")
    ("e" (lambda () (interactive) (pop-to-buffer "*eshell*")) "*eshell*")
    ("m" (lambda () (interactive) (pop-to-buffer "*Messages*")) "*Messages*")
    ("b" helm-buffers-list "helm buffers list"))

  (evil-leader/set-key "b" 'hydra-buffers/body)
#+end_src
** Files
#+begin_src elisp

  (evil-leader/set-key "f" 'hydra-files/body)

  (defhydra hydra-files (:color blue)
    "Files"

    ("d" (lambda () (interactive)
	   (find-file "~/projects/emacs-config/init.org"))
     "dot-file")

    ("g" (lambda () (interactive)
	  (find-file "~/org/agenda/gtd.org"))
     "gtd")
    ("f" helm-find-files "helm-find-files")
    ("m" helm-multi-files "helm-multi-files")
    ("b" helm-filtered-bookmarks "helm-filtered-bookmarks")
    ("t" neotree-toggle "neotree-toggle")
    ("r" helm-recentf "recentf-open-files"))

#+end_src
** Applications
#+begin_src elisp
  ;; (defhydra hydra-applications ()
  ;;   "Applications"
  ;;   ("d" deft "deft find file"))
  (evil-leader/set-key "ad" 'deft)
  (evil-leader/set-key "am" 'mu4e)
#+end_src
* Yasnippet
#+begin_src elisp

  (use-package yasnippet
    :diminish yas-minor-mode
    :init
    (defhydra hydra-yasnippet (:color blue :hint nil)
      "
                  ^YASnippets^
    --------------------------------------------
      Modes:    Load/Visit:    Actions:

     _g_lobal  _d_irectory    _i_nsert
     _m_inor   _f_ile         _t_ryout
     _e_xtra   _l_ist         _n_ew
             _a_ll
    "
      ("d" yas-load-directory)
      ("e" yas-activate-extra-mode)
      ("i" yas-insert-snippet)
      ("f" yas-visit-snippet-file :color blue)
      ("n" yas-new-snippet)
      ("t" yas-tryout-snippet)
      ("l" yas-describe-tables)
      ("g" yas/global-mode)
      ("m" yas/minor-mode)
      ("a" yas-reload-all))
    (evil-leader/set-key "y" 'hydra-yasnippet/body)
    :defer 15
    ; not sure why this doesn't work
    ; :commands hydra-yasnippet/body
    :config
    (require 'yasnippet)
    (yas-global-mode 1))
#+end_src
* Org-mode
