init.org
** General
#+begin_src elisp
  (use-package org
    :mode (("\\.org$" . org-mode))
    :commands (org-agenda org-capture)
    :load-path "~/.emacs.d/packages/org-mode/lisp"
    :diminish org-mode
    :init
    (evil-leader/set-key
        "oa" 'org-agenda
        "oc" 'org-capture
        "ot" 'hydra-org-clock/body)
    :config
    (setq as/agenda (concat (getenv "HOME") "/org/agenda/"))
    (setq as/views (concat (getenv "HOME") "/org/views/"))
    (setq as/gtd (concat as/agenda "gtd.org"))

    (load "org-config")
    (add-hook 'org-mode-hook 'toggle-truncate-lines)
    (setq org-hide-leading-stars t)
    (setq org-default-notes-file "/Users/andrew/org/notes.org")
    (setq org-todo-keywords
      '((sequence "TODO" "|" "DONE")))
    (setq org-refile-targets '((nil :maxlevel . 3)
                               (org-agenda-files :maxlevel . 2)))
    (setq org-outline-path-complete-in-steps nil)
    (setq org-completion-use-ido nil)
    (setq org-refile-use-outline-path t) 
    (defun as/verify-refile-target ()
      "Exclude todo keywords with a done state from refile targets"
      (not (member (nth 2 (org-heading-components)) org-done-keywords)))
    (setq org-refile-target-verify-function 'as/verify-refile-target)
    (setq org-refile-allow-creating-parent-nodes 'confirm)
    (setq org-src-fontify-natively t))

    (use-package org-pomodoro
      :commands org-pomodoro
      :config
      (setq mindfulness-bell "/Users/andrew/Music/Miscellaneous/Timer_Sounds/mindfullness_bell.mp3") 
      (setq mindfulness-chimes "/Users/andrew/Music/Miscellaneous/Timer_Sounds/chimes.mp3") 
      (setq org-pomodoro-length 15)
      (setq org-pomodoro-short-break-length .5)
      (setq org-pomodoro-start-sound mindfulness-bell)
      (setq org-pomodoro-finished-sound mindfulness-bell)
      (setq org-pomodoro-short-break-sound mindfulness-bell)
      (setq org-pomodoro-long-break-sound mindfulness-chimes)
      (setq org-pomodoro-start-sound-p t))
#+end_src
** Custom
#+BEGIN_SRC elisp :tangle org-config.el
(provide 'as/layer-org)
#+END_SRC
** Babel
#+begin_src elisp :tangle org-config.el
  ; Can't remember what I wanted this for...
  ; (use-package org-plus-contrib) 
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)))
   (setq org-confirm-babel-evaluate nil)
#+end_src
** Capture
#+begin_src elisp :tangle org-config.el
  (setq org-capture-templates
        '(("t" "TODO" entry (file+headline as/gtd "Collect")
           "* TODO %? \n%U" :empty-lines 1)
          ("p" "Priority" entry (file+headline as/gtd "Collect")
           "* TODO [#A] %? \nSCHEDULED: %^t")
          ("a" "Appointment" entry (file+headline as/gtd "Collect")
           "* %? \n%^t")
          ("l" "Link" entry (file+headline as/gtd "Collect")
           "* TODO %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
          ("n" "Note" entry (file+headline as/gtd "Notes")
             "* %?\n%U" :empty-lines 1)
          ("j" "Journal" entry (file+datetree "/Users/andrew/org/agenda/journal.org")
          "* %?\nEntered on %U\n")))
#+end_src
** Agenda
#+begin_src elisp :tangle org-config.el
  (setq org-agenda-include-diary t)
   (setq org-tag-persistent-alist '(("PMI" . ?p)
                                    ("work" . ?w)
                                    ("buy" . ?b)
                                    ("sdm" . ?m)
                                    ("X" . ?x)
                                    ("read" . ?r)
                                    ("school" . ?s)))

  (setq org-agenda-files '("/Users/andrew/org/agenda/"
                           "/Users/andrew/org/projects/"))

   (defun org-archive-done-tasks ()
     (interactive)
     (org-map-entries
      (lambda ()
        (org-archive-subtree)
        (setq org-map-continue-from (outline-previous-heading))) "/DONE" 'agenda))

   (setq org-agenda-sorting-strategy
         '((agenda habit-down timestamp-down priority-down category-keep)
           (todo priority-down timestamp-down category-keep)
           (tags priority-down timestamp-down category-keep)
           (search category-keep timestamp-down)))

   (setq org-agenda-custom-commands
         `(("a" "Current day/week" agenda "" nil
            (,(concat as/views "agenda.ics")
             ,(concat as/views "agenda.org")
             ,(concat as/views "agenda.html")))
           ("p" "PMI"
            ((tags-todo "TODO=\"TODO\"+category=\"PMI\"")
             (tags-todo "TODO=\"DONE\"+category=\"PMI\""))
            ((org-agenda-overriding-header "")
             (org-agenda-remove-tags t))
            (,(concat as/views "pmi-dev-plan.org")))
           ("f" "Fluent Forever"
            ((tags-todo "TODO=\"TODO\"+category=\"Fluent Forever\""))
            ((org-agenda-overriding-header "")
             (org-agenda-remove-tags t)))
           ("Aa" "ALL"
            ((alltodo))
            ((org-agenda-overriding-header "All"))
            (,(concat as/views "all.org")))))
#+end_src
** Hydras
*** Main
#+begin_src elisp :tangle org-config.el
  (defhydra hydra-org-mode ()
    "Org-mode"
    ("t" org-todo "org-todo")
    (":" org-set-tags-command "org-set-tags-command")
    ("n" org-narrow-to-subtree "org-narrow-to-subtree")
    ("w" widen "widen")
    ("s" org-sort)
    ("l" org-demote-subtree "org-demote-subtree")
    ("h" org-promote-subtree "org-promote-subtree")
    ("K" outline-up-heading "org-backward-heading-same-level")
    ("J" org-forward-heading-same-level "org-forward-heading-same-level")
    ("k" outline-previous-visible-heading "outline-previous-visible-heading")
    ("j" outline-next-visible-heading "outline-next-visible-heading")
    ("*" org-toggle-heading "org-toggle-heading")
    ("$" org-archive-done-tasks "org-archive-done-tasks"))
    (evil-leader/set-key-for-mode 'org-mode "m" 'hydra-org-mode/body)
#+end_src
*** Clock
#+begin_src elisp :tangle org-config.el
  (defhydra hydra-org-clock (:color blue :hint nil)
          "
          Clock   In/out^     ^Edit^   ^Summary     (_?_)
          -----------------------------------------
                  _i_n         _e_dit   _g_oto entry
                  _c_ontinue   _q_uit   _d_isplay
                  _o_ut        ^ ^      _r_eport
                  _p_omodoro
          "
          ("i" org-clock-in)
          ("o" org-clock-out)
          ("c" org-clock-in-last)
          ("e" org-clock-modify-effort-estimate)
          ("q" org-clock-cancel)
          ("p" org-pomodoro)
          ("g" org-clock-goto)
          ("d" org-clock-display)
          ("r" org-clock-report)
          ("?" (org-info "Clocking commands")))
#+end_src
*** Block templates
#+begin_src elisp :tangle org-config.el
(defhydra hydra-org-template (:color blue :hint nil)
  "
_c_enter  _q_uote    _L_aTeX:
_l_atex   _e_xample  _i_ndex:
_a_scii   _v_erse    _I_NCLUDE:
_s_rc     ^ ^        _H_TML:
_h_tml    ^ ^        _A_SCII:
"
  ("s" (hot-expand "<s"))
  ("e" (hot-expand "<e"))
  ("q" (hot-expand "<q"))
  ("v" (hot-expand "<v"))
  ("c" (hot-expand "<c"))
  ("l" (hot-expand "<l"))
  ("h" (hot-expand "<h"))
  ("a" (hot-expand "<a"))
  ("L" (hot-expand "<L"))
  ("i" (hot-expand "<i"))
  ("I" (hot-expand "<I"))
  ("H" (hot-expand "<H"))
  ("A" (hot-expand "<A"))
  ("<" self-insert-command "ins")
  ("o" nil "quit"))

(defun hot-expand (str)
  "Expand org template."
  (insert str)
  (org-try-structure-completion))

  (define-key org-mode-map "<"
  (lambda () (interactive)
     (if (looking-back "^")
         (hydra-org-template/body)
       (self-insert-command 1))))
#+end_src
* Windows and frames
** Toolbar
   Save space by not showing the toolbar
#+begin_src elisp
(tool-bar-mode -1)
#+end_src
** Golden ratio mode
#+begin_src elisp
  (use-package golden-ratio
    :commands
    (evil-window-next
     evil-window-right
     evil-window-left
     evil-window-down
     evil-window-up)
    :config
    (golden-ratio-mode 1)
    (add-to-list 'golden-ratio-extra-commands 'evil-window-next)
    (add-to-list 'golden-ratio-extra-commands 'evil-window-right)
    (add-to-list 'golden-ratio-extra-commands 'evil-window-left)
    (add-to-list 'golden-ratio-extra-commands 'evil-window-down)
    (add-to-list 'golden-ratio-extra-commands 'evil-window-up))
#+end_src
** Winner mode
Undo and redo window configuration
#+begin_src elisp
  (use-package winner
    :init
    (evil-leader/set-key
      "wu" 'winner-undo
      "wr" 'winner-redo)
    :commands
    (winner-undo winner-redo)
    :config
    (winner-mode))
#+end_src
** Zoom
#+begin_src elisp
  (use-package zoom-frm
    :commands hydra-zoom)

  (defhydra hydra-zoom (global-map "M-=")
    "zoom"
    ("g" text-scale-increase)
    ("l" text-scale-decrease)
    ("i" zoom-in)
    ("o" zoom-out))
#+end_src
* Backups
#+begin_src elisp
;; Special dir for backups
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
#+end_src

* Magit

#+begin_src elisp
  (use-package magit
    :init (evil-leader/set-key "gs" 'magit-status)
    :commands magit-status
    :config
    (setq magit-git-executable "~/usr/bin/git")
    (add-hook 'git-commit-mode-hook 'git-commit-turn-on-flyspell)
    (evil-set-initial-state 'git-commit-mode 'normal))
#+end_src
* Better defaults
Also look at sensible-defaults
#+begin_src elisp
(show-paren-mode 1)
(menu-bar-mode -1)
(when (fboundp 'tool-bar-mode)
    (tool-bar-mode -1))
(when (fboundp 'scroll-bar-mode)
    (scroll-bar-mode -1))
(when (fboundp 'horizontal-scroll-bar-mode)
    (horizontal-scroll-bar-mode -1))

(require 'uniquify)
(setq uniquify-buffer-name-style 'forward)

(require 'saveplace)
(setq-default save-place t)
(fset 'yes-or-no-p 'y-or-n-p)
(setq initial-scratch-message "") ;; Uh, I know what Scratch is for

#+end_src

** My own
#+begin_src elisp
  (use-package visual-fill-column
    :init
    (global-visual-fill-column-mode)
    (evil-leader/set-key "tl" 'visual-fill-column-mode)
    :config
    (add-hook 'rst-mode-hook 'visual-line-mode))
#+end_src
* Tramp
#+begin_src elisp
;; This doesn't actually seem to be faster...
;; (setq tramp-default-method "ssh")
(setq tramp-inline-compress-start-size 1000000)
#+end_src

* Python

