init.el
  :mode (("\\.org$" . org-mode))
  :commands (org-agenda org-capture)
  :load-path "~/.emacs.d/packages/org-mode/lisp"
  :diminish org-mode
  :init
  (evil-leader/set-key
      "oa" 'org-agenda
      "oc" 'org-capture
      "ot" 'hydra-org-clock/body)
  :config
  (setq as/agenda (concat (getenv "HOME") "/org/agenda/"))
  (setq as/views (concat (getenv "HOME") "/org/views/"))
  (setq as/gtd (concat as/agenda "gtd.org"))

  (load "org-config")
  (add-hook 'org-mode-hook 'toggle-truncate-lines)
  (setq org-hide-leading-stars t)
  (setq org-default-notes-file "/Users/andrew/org/notes.org")
  (setq org-todo-keywords
    '((sequence "TODO" "|" "DONE")))
  (setq org-refile-targets '((nil :maxlevel . 3)
                             (org-agenda-files :maxlevel . 2)))
  (setq org-outline-path-complete-in-steps nil)
  (setq org-completion-use-ido nil)
  (setq org-refile-use-outline-path t) 
  (defun as/verify-refile-target ()
    "Exclude todo keywords with a done state from refile targets"
    (not (member (nth 2 (org-heading-components)) org-done-keywords)))
  (setq org-refile-target-verify-function 'as/verify-refile-target)
  (setq org-refile-allow-creating-parent-nodes 'confirm)
  (setq org-src-fontify-natively t))

  (use-package org-pomodoro
    :commands org-pomodoro
    :config
    (setq mindfulness-bell "/Users/andrew/Music/Miscellaneous/Timer_Sounds/mindfullness_bell.mp3") 
    (setq mindfulness-chimes "/Users/andrew/Music/Miscellaneous/Timer_Sounds/chimes.mp3") 
    (setq org-pomodoro-length 15)
    (setq org-pomodoro-short-break-length .5)
    (setq org-pomodoro-start-sound mindfulness-bell)
    (setq org-pomodoro-finished-sound mindfulness-bell)
    (setq org-pomodoro-short-break-sound mindfulness-bell)
    (setq org-pomodoro-long-break-sound mindfulness-chimes)
    (setq org-pomodoro-start-sound-p t))

;; Toolbar
;;    Save space by not showing the toolbar

(tool-bar-mode -1)

;; Golden ratio mode

(use-package golden-ratio
  :commands
  (evil-window-next
   evil-window-right
   evil-window-left
   evil-window-down
   evil-window-up)
  :config
  (golden-ratio-mode 1)
  (add-to-list 'golden-ratio-extra-commands 'evil-window-next)
  (add-to-list 'golden-ratio-extra-commands 'evil-window-right)
  (add-to-list 'golden-ratio-extra-commands 'evil-window-left)
  (add-to-list 'golden-ratio-extra-commands 'evil-window-down)
  (add-to-list 'golden-ratio-extra-commands 'evil-window-up))

(use-package winner
  :commands
  (winner-undo winner-redo)
  :config
  (winner-mode)
  (evil-leader/set-key
    "wu" 'winner-undo
    "wr" 'winner-redo))

(use-package zoom-frm
  :commands hydra-zoom)

(defhydra hydra-zoom (global-map "M-=")
  "zoom"
  ("g" text-scale-increase)
  ("l" text-scale-decrease)
  ("i" zoom-in)
  ("o" zoom-out))

;; Special dir for backups
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))

(use-package magit
  :init (evil-leader/set-key "gs" 'magit-status)
  :commands magit-status
  :config
  (setq magit-git-executable "~/usr/bin/git"))
  (setq magit-git-executable "~/usr/bin/git")
  (add-hook 'git-commit-mode-hook 'git-commit-turn-on-flyspell)
  (evil-set-initial-state 'git-commit-mode 'normal))

(show-paren-mode 1)
(menu-bar-mode -1)
(when (fboundp 'tool-bar-mode)
    (tool-bar-mode -1))
(when (fboundp 'scroll-bar-mode)
    (scroll-bar-mode -1))
(when (fboundp 'horizontal-scroll-bar-mode)
    (horizontal-scroll-bar-mode -1))

(require 'uniquify)
(setq uniquify-buffer-name-style 'forward)

(require 'saveplace)
(setq-default save-place t)
(fset 'yes-or-no-p 'y-or-n-p)
(setq initial-scratch-message "") ;; Uh, I know what Scratch is for

;; My own

(use-package visual-fill-column
  :init
  (global-visual-fill-column-mode)
  (evil-leader/set-key "tl" 'visual-fill-column-mode)
  :config
  (add-hook 'rst-mode-hook 'visual-line-mode))
;; This doesn't actually seem to be faster...
;; (setq tramp-default-method "ssh")
(setq tramp-inline-compress-start-size 1000000)

;; General
