init.org
** Company

 #+begin_src elisp
   (use-package company
     :diminish company-mode
     :config
     (global-company-mode))
 #+end_src
* Words
** Wordnut
#+begin_src elisp :tangle no
  (use-package wordnut
    :commands (wordnut-search wordnut-lookup-current-word)
    :load-path "packages/wordnut"
    :config
    (require 'wordnut)
    (setq wordnut-cmd "/usr/local/bin/wn"))
#+end_src
** Helm-wordnet
#+begin_src elisp
  (use-package helm-wordnet
    :commands helm-wordnet
    :load-path "packages/helm-wordnet"
    :config
    (setq helm-wordnet-prog "/usr/local/bin/wn"))
    (evil-leader/set-key
      "wd" 'helm-wordnet)
#+end_src

** Google translate
#+begin_src elisp
  (use-package google-translate
    :commands (google-translate-at-point google-translate-smooth-translate)
    :config
    (setq google-translate-default-source-language "nl")
    (setq google-translate-default-target-language "en")
    (evil-leader/set-key
      "wp" 'google-translate-at-point
      "ww" 'google-translate-smooth-translate))
#+end_src

* Display
#+begin_src elisp
(use-package linum-relative
    :config
    (linum-relative-global-mode))
(setq column-number-mode t)
#+end_src
* Flycheck
#+begin_src elisp
  (use-package flycheck
    :init
    (add-hook 'after-init-hook 'global-flycheck-mode)
    :config
    (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc))
    (defhydra hydra-flycheck
      (:pre (progn (setq hydra-lv t) (flycheck-list-errors))
      :post (progn (setq hydra-lv nil) (quit-windows-on "*Flycheck errors*"))
      :hint nil)
      "Errors"
      ("f"  flycheck-error-list-set-filter                            "Filter")
      ("n"  flycheck-next-error                                       "Next")
      ("p"  flycheck-previous-error                                   "Previous")
      ("gg" flycheck-first-error                                      "First")
      ("G"  (progn (goto-char (point-max)) (flycheck-previous-error)) "Last")
      ("q"  nil)))
#+end_src
* Deft
#+begin_src elisp
  (use-package deft
    :commands deft
    :config
    (setq deft-directory "~/org")
    (setq deft-extensions '("txt" "org"))
    (setq deft-default-extension "org")
    (setq deft-recursive t)
    (setq deft-use-filename-as-title t)
    (setq deft-use-filter-string-for-filename t))

#+end_src
* Elfeed
#+begin_src elisp
(use-package elfeed
    :commands elfeed
    :config
    (add-to-list 'evil-emacs-state-modes 'elfeed-search-mode)
    (use-package elfeed-org
      :config
      (require 'elfeed-org)
      (elfeed-org)
      (setq rmh-elfeed-org-files (list "~/org/elfeed.org"))))
#+end_src
* Mail
** smtp
#+begin_src elisp
  (setq message-send-mail-function 'smtpmail-send-it
     starttls-use-gnutls t
     smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil))
     smtpmail-auth-credentials
       '(("smtp.gmail.com" 587 "inbox.asanchez@gmail.com" nil))
     smtpmail-default-smtp-server "smtp.gmail.com"
     smtpmail-smtp-server "smtp.gmail.com"
     smtpmail-smtp-service 587)
  (setq message-kill-buffer-on-exit t)
#+end_src
** MU4E
 #+begin_src elisp
   (add-to-list 'load-path "/usr/local/Cellar/mu/HEAD-65863e4_1/share/emacs/site-lisp")
   (require 'mu4e)
   (add-hook 'message-send-hook (lambda () (mu4e-update-mail-and-index t)))
   (require 'org-mu4e) ;; store org-mode links to messages
   ;;store link to message if in header view, not to header query
   (setq org-mu4e-link-query-in-headers-mode nil)
   (setq mu4e-change-filenames-when-moving t)
   (setq mu4e-sent-messages-behavior 'delete)
   (setq mu4e-mu-binary "/usr/local/bin/mu")
   (setq mu4e-get-mail-command "/usr/local/bin/mbsync -a")
   (setq mu4e-maildir (expand-file-name "~/Maildir"))
   (setq mu4e-drafts-folder "/drafts") 
   (setq mu4e-sent-folder "/sent")
   (setq mu4e-trash-folder "/trash")
   (setq mu4e-refile-folder "/all")
   (setq mu4e-maildir-shortcuts
         '(("/INBOX". ?i)
           ("/sent" . ?s)
           ("/trash" . ?t)
           ("/all" . ?a)
           ("/drafts" . ?d)))
   (evil-set-initial-state 'mu4e-view-mode 'motion)
   (add-hook 'message-mode-hook 'turn-on-orgstruct++)
   (add-hook 'mu4e-compose-mode-hook 'turn-on-flyspell)
   (add-hook 'mu4e-compose-mode-hook 'visual-line-mode)
   (add-hook 'mu4e-view-mode-hook 'visual-line-mode)
 #+end_src
** Gnus
 #+begin_src elisp :tangle no
   (use-package gnus
     :commands gnus
     :config
       (add-to-list 'evil-emacs-state-modes 'gnus-group-mode)
       (setq gnus-select-method
	     '(nnimap "gmail"
		      (nnimap-address "imap.gmail.com")
		      (nnimap-server-port "993")
		      (nnimap-stream ssl)))
       (setq gnus-ignored-newsgroups "^to\\.\\|^[0-9. ]+\\( \\|$\\)\\|^[\"]\"[#'()]"
	     gnus-message-archive-group nil)
	     ;; mml2015-encrypt-to-self 
       ;; Attempt to encrypt all outgoin emails
       ;; (add-hook 'message-setup-hook 'mml-secure-message-encrypt)
       (eval-after-load 'gnus-group
       '(progn
	  (defhydra hydra-gnus-group (:color blue)
	    "Do?"
	    ("l" gnus-group-list-all-groups "List subscribed groups")
	    ("a" gnus-group-list-active "List groups on servers")
	    ("c" gnus-group-catchup-all "Read all")
	    ("G" gnus-group-make-nnir-group "Search server G G")
	    ("g" gnus-group-get-new-news "Refresh g")
	    ("s" gnus-group-enter-server-mode "Servers")
	    ("m" gnus-group-new-mail "Compose m OR C-x m")
	    ("#" gnus-topic-mark-topic "mark #")
	    ("q" nil "cancel"))
	  (define-key gnus-group-mode-map "," 'hydra-gnus-group/body)))

     ;; gnus-summary-mode
     (eval-after-load 'gnus-sum
       '(progn
	  (defhydra hydra-gnus-summary (:color blue)
	    "Do?"
	    ("s" gnus-summary-show-thread "Show thread")
	    ("h" gnus-summary-hide-thread "Hide thread")
	    ("n" gnus-summary-insert-new-articles "Refresh / N")
	    ("f" gnus-summary-mail-forward "Forward C-c C-f")
	    ("!" gnus-summary-tick-article-forward "Mail -> disk !")
	    ("p" gnus-summary-put-mark-as-read "Mail <- disk")
	    ("c" gnus-summary-catchup-and-exit "Read all c")
	    ("e" gnus-summary-resend-message-edit "Resend S D e")
	    ("R" gnus-summary-reply-with-original "Reply with original R")
	    ("r" gnus-summary-reply "Reply r")
	    ("W" gnus-summary-wide-reply-with-original "Reply all with original S W")
	    ("w" gnus-summary-wide-reply "Reply all S w")
	    ("#" gnus-topic-mark-topic "mark #")
	    ("q" nil "cancel"))
	  (define-key gnus-summary-mode-map "," 'hydra-gnus-summary/body)))

     ;; gnus-article-mode
     (eval-after-load 'gnus-art
       '(progn
	  (defhydra hydra-gnus-article (:color blue)
	    "Do?"
	    ("f" gnus-summary-mail-forward "Forward")
	    ("R" gnus-article-reply-with-original "Reply with original R")
	    ("r" gnus-article-reply "Reply r")
	    ("W" gnus-article-wide-reply-with-original "Reply all with original S W")
	    ("o" gnus-mime-save-part "Save attachment at point o")
	    ("w" gnus-article-wide-reply "Reply all S w")
	    ("q" nil "cancel"))
	  (define-key gnus-article-mode-map "," 'hydra-gnus-article/body)))

     (eval-after-load 'message
       '(progn (add-hook 'message-mode-hook 'flyspell-mode)
	  (defhydra hydra-message (:color blue)
	    "Do?"
	    ("ca" mml-attach-file "Attach C-c C-a")
	    ("cc" message-send-and-exit "Send C-c C-c")
	    ("q" nil "cancel"))
	  (global-set-key (kbd "C-c C-y") 'hydra-message/body))))
 #+end_src
** Hydra
#+begin_src elisp
  (defhydra hydra-mail (:color blue)
    "Mail"
    ("M" mu4e "mu4e")
    ("m" mu4e~main-menu "mu4e main menu"))
#+end_src

* Keyfreq
#+begin_src elisp
  (use-package keyfreq
    :defer 5
    :config
    (require 'keyfreq)
    (setq keyfreq-excluded-commands
	  '(self-insert-command
	    abort-recursive-edit
	    forward-char
	    backward-char
	    previous-line
	    next-line
	    evil-a-WORD
	    evil-append
	    evil-backward-char
	    evil-backward-word-begin
	    evil-change
	    evil-change-line
	    evil-complete-next
	    evil-complete-previous
	    evil-delete
	    evil-delete-backward-char-and-join
	    evil-delete-char
	    evil-delete-line
	    evil-emacs-state
	    evil-end-of-line
	    evil-escape-emacs-state
	    evil-escape-insert-state
	    evil-escape-isearch
	    evil-escape-minibuffer
	    evil-escape-motion-state
	    evil-escape-visual-state))
    (keyfreq-mode 1)
    (keyfreq-autosave-mode 1))
#+end_src
* Convenience
#+begin_src elisp
  (use-package restart-emacs
    :init
    (evil-leader/set-key "qr" 'restart-emacs)
    :commands restart-emacs)
#+end_src
* Neotree
#+begin_src elisp
  (use-package neotree :load-path "~/.emacs.d/packages/neotree"
    :commands  neotree-toggle
    :config
    (require 'neotree)
    (evil-define-key 'normal neotree-mode-map (kbd "TAB") 'neotree-enter)
    (evil-define-key 'normal neotree-mode-map (kbd "SPC") 'neotree-quick-look)
    (evil-define-key 'normal neotree-mode-map (kbd "q") 'neotree-hide)
    (evil-define-key 'normal neotree-mode-map (kbd "RET") 'neotree-enter))
#+end_src
* Debugging
** NEXT Figure out how to defer realgud
#+begin_src elisp
  (use-package realgud
    :commands realgud
    :config
    (add-hook 'realgud-short-key-mode-hook
        (lambda ()
          (local-set-key "," realgud:shortkey-mode-map)))
	  (setq realgud:pdb-command-name "python -m pdb"))
#+end_src

* Fun
** Gnugo
#+begin_src elisp
   (use-package gnugo
     :commands gnugo
     :config
     (add-to-list 'evil-emacs-state-modes 'gnugo-board-mode)
     (add-hook 'gnugo-start-game-hook 'gnugo-image-display-mode)
     (setq gnugo-xpms 'gnugo-imgen-create-xpms))
#+end_src 
* Test
#+begin_src elisp :tangle no
#+end_src  
* Future
** TODO [[https://github.com/tlh/workgroups.el][Workgroups]]
   Workgroups for Windows (for Emacs)
It's tedious setting Emacs' window layout just the way you like it -- splitting windows, adjusting their size, switching to the right buffers, etc. And even when it is set, it won't stay that way for long. On top of that, you can't save your window-configurations to disk, so you have to start over from scratch every time you restart Emacs.

There are solutions out there to parts of the problem -- elscreen, revive.el, window-configuration-to-register, etc. -- but none provide a complete solution. Workgroups does.

With Workgroups, you can:

Store an unlimited number of window configs

Save window configs to disk, and load them from disk

Kill and yank window configs

It also provides:

Animated window config morphing

Frame reversing and window movement

A concept of "base" and "working" configs, for maximum flexibility

Lots of other stuff
