init.el

(use-package company
  :config
  (global-company-mode))

(use-package helm-wordnet
  :commands helm-wordnet
  :load-path "packages/helm-wordnet"
  :config
  (setq helm-wordnet-prog "/usr/local/bin/wn"))
  (evil-leader/set-key
    "wd" 'helm-wordnet)

(use-package google-translate
  :commands (google-translate-at-point google-translate-smooth-translate)
  :config
  (setq google-translate-default-source-language "nl")
  (setq google-translate-default-target-language "en")
  (evil-leader/set-key
    "wp" 'google-translate-at-point
    "ww" 'google-translate-smooth-translate))

(use-package linum-relative
    :config
    (linum-relative-global-mode))
(setq column-number-mode t)

(use-package flycheck
  :init
  (add-hook 'after-init-hook 'global-flycheck-mode)
  :config
  (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc))
  (defhydra hydra-flycheck
    (:pre (progn (setq hydra-lv t) (flycheck-list-errors))
    :post (progn (setq hydra-lv nil) (quit-windows-on "*Flycheck errors*"))
    :hint nil)
    "Errors"
    ("f"  flycheck-error-list-set-filter                            "Filter")
    ("n"  flycheck-next-error                                       "Next")
    ("p"  flycheck-previous-error                                   "Previous")
    ("gg" flycheck-first-error                                      "First")
    ("G"  (progn (goto-char (point-max)) (flycheck-previous-error)) "Last")
    ("q"  nil)))

;; Deft

(use-package deft
  :commands deft
  :config
  (setq deft-directory "~/org")
  (setq deft-extensions '("txt" "org"))
  (setq deft-default-extension "org")
  (setq deft-recursive t)
  (setq deft-use-filename-as-title t)
  (setq deft-use-filter-string-for-filename t))

;; Elfeed

(use-package elfeed
    :commands elfeed
    :config
    (add-to-list 'evil-emacs-state-modes 'elfeed-search-mode)
    (use-package elfeed-org
      :config
      (require 'elfeed-org)
      (elfeed-org)
      (setq rmh-elfeed-org-files (list "~/org/elfeed.org"))))

(setq message-send-mail-function 'smtpmail-send-it
   starttls-use-gnutls t
   smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil))
   smtpmail-auth-credentials
     '(("smtp.gmail.com" 587 "inbox.asanchez@gmail.com" nil))
   smtpmail-default-smtp-server "smtp.gmail.com"
   smtpmail-smtp-server "smtp.gmail.com"
   smtpmail-smtp-service 587)
(setq message-kill-buffer-on-exit t)

;; MU4E

(add-to-list 'load-path "/usr/local/Cellar/mu/HEAD-65863e4_1/share/emacs/site-lisp")
(require 'mu4e)
(add-hook 'message-send-hook (lambda () (mu4e-update-mail-and-index t)))
(require 'org-mu4e) ;; store org-mode links to messages
;;store link to message if in header view, not to header query
(setq org-mu4e-link-query-in-headers-mode nil)
(setq mu4e-change-filenames-when-moving t)
(setq mu4e-sent-messages-behavior 'delete)
(setq mu4e-mu-binary "/usr/local/bin/mu")
(setq mu4e-get-mail-command "/usr/local/bin/mbsync -a")
(setq mu4e-maildir (expand-file-name "~/Maildir"))
(setq mu4e-drafts-folder "/drafts") 
(setq mu4e-sent-folder "/sent")
(setq mu4e-trash-folder "/trash")
(setq mu4e-refile-folder "/all")
(setq mu4e-maildir-shortcuts
      '(("/INBOX". ?i)
        ("/sent" . ?s)
        ("/trash" . ?t)
        ("/all" . ?a)
        ("/drafts" . ?d)))
(evil-set-initial-state 'mu4e-view-mode 'motion)
(add-hook 'message-mode-hook 'turn-on-orgstruct++)
(add-hook 'mu4e-compose-mode-hook 'turn-on-flyspell)
(add-hook 'mu4e-compose-mode-hook 'visual-line-mode)
(add-hook 'mu4e-view-mode-hook 'visual-line-mode)

;; Hydra

(defhydra hydra-mail (:color blue)
  "Mail"
  ("M" mu4e "mu4e")
  ("m" mu4e~main-menu "mu4e main menu"))

;; Keyfreq

(use-package keyfreq
  :defer 5
  :config
  (require 'keyfreq)
  (setq keyfreq-excluded-commands
	'(self-insert-command
	  abort-recursive-edit
	  forward-char
	  backward-char
	  previous-line
	  next-line
	  evil-a-WORD
	  evil-append
	  evil-backward-char
	  evil-backward-word-begin
	  evil-change
	  evil-change-line
	  evil-complete-next
	  evil-complete-previous
	  evil-delete
	  evil-delete-backward-char-and-join
	  evil-delete-char
	  evil-delete-line
	  evil-emacs-state
	  evil-end-of-line
	  evil-escape-emacs-state
	  evil-escape-insert-state
	  evil-escape-isearch
	  evil-escape-minibuffer
	  evil-escape-motion-state
	  evil-escape-visual-state))
  (keyfreq-mode 1)
  (keyfreq-autosave-mode 1))

(use-package restart-emacs
  :init
  (evil-leader/set-key "qr" 'restart-emacs)
  :commands restart-emacs)

(use-package neotree :load-path "~/.emacs.d/packages/neotree"
  :commands  neotree-toggle
  :config
  (require 'neotree)
  (evil-define-key 'normal neotree-mode-map (kbd "TAB") 'neotree-enter)
  (evil-define-key 'normal neotree-mode-map (kbd "SPC") 'neotree-quick-look)
  (evil-define-key 'normal neotree-mode-map (kbd "q") 'neotree-hide)
  (evil-define-key 'normal neotree-mode-map (kbd "RET") 'neotree-enter))

(use-package realgud
  :commands realgud
  :config
  (load-library "realgud")
  (add-hook 'realgud-short-key-mode-hook
      (lambda ()
        (local-set-key "\C-c" realgud:shortkey-mode-map)))
	(setq realgud:pdb-command-name "python -m pdb"))

(use-package gnugo
  :commands gnugo
  :config
  (add-to-list 'evil-emacs-state-modes 'gnugo-board-mode)
  (add-hook 'gnugo-start-game-hook 'gnugo-image-display-mode)
  (setq gnugo-xpms 'gnugo-imgen-create-xpms))
